Revit 2024 API
RebarContainerItem.SetFromRebarShape Method
 Set an instance of a RebarContainerItem element, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks are removed from the shape before computing its bounding box. If appropriate hooks can be found in the document, they will be assigned arbitrarily.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetFromRebarShape(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ origin,
	XYZ xVec,
	XYZ yVec
)
Visual Basic
Public Sub SetFromRebarShape ( _
	rebarShape As RebarShape, _
	barType As RebarBarType, _
	origin As XYZ, _
	xVec As XYZ, _
	yVec As XYZ _
)
Visual C++
public:
void SetFromRebarShape(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ origin,
	XYZ^ xVec,
	XYZ^ yVec
)
Parameters
rebarShape
Type: Autodesk.Revit.DB.Structure.RebarShape
 A RebarShape element that defines the shape of the rebar.
barType
Type: Autodesk.Revit.DB.Structure.RebarBarType
 A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
origin
Type: Autodesk.Revit.DB.XYZ
 The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec
Type: Autodesk.Revit.DB.XYZ
 The x-axis in the shape definition will be mapped to this direction in the project.
yVec
Type: Autodesk.Revit.DB.XYZ
 The y-axis in the shape definition will be mapped to this direction in the project.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The rebarShape has End Treatments
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  xVec has zero length. -or- yVec has zero length.
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace